In [1]:
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt

import warnings
warnings.filterwarnings('ignore')

In [2]:
df=pd.read_csv("titanic_train.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

### Group by Sex & Pclass → Mean Age + Total Survivors

In [3]:

table = pd.pivot_table(
    df,
    index=['Sex', 'Pclass'],
    aggfunc={'Age': np.mean, 'Survived': np.sum}
)

In [4]:
table

                     Age  Survived
Sex    Pclass
female 1       34.611765        91
       2       28.722973        70
       3       21.750000        72
male   1       41.281386        45
       2       30.740707        17
       3       26.507589        47

In [5]:

table1 = df.groupby(['Sex', 'Pclass']).agg({'Age': 'mean', 'Survived': 'sum'})

In [6]:
table1

                     Age  Survived
Sex    Pclass
female 1       34.611765        91
       2       28.722973        70
       3       21.750000        72
male   1       41.281386        45
       2       30.740707        17
       3       26.507589        47

### Mean Survival Rate by Sex & Pclass

In [7]:

table2 = pd.pivot_table(
    df,
    index=['Sex', 'Pclass'],
    values='Survived',
    aggfunc=np.mean
)

table2

               Survived
Sex    Pclass
female 1       0.968085
       2       0.921053
       3       0.500000
male   1       0.368852
       2       0.157407
       3       0.135447

In [8]:
table3 = df.groupby(['Sex', 'Pclass'])['Survived'].mean()

In [9]:
table3

Sex     Pclass
female  1         0.968085
        2         0.921053
        3         0.500000
male    1         0.368852
        2         0.157407
        3         0.135447
Name: Survived, dtype: float64

### Survivors by Sex vs Pclass (Matrix-style)

In [10]:
table4 = pd.pivot_table(
    df,
    index='Sex',
    columns='Pclass',
    values='Survived',
    aggfunc=np.sum,
    fill_value=0
)

table4

Pclass   1   2   3
Sex
female  91  70  72
male    45  17  47

In [11]:
table5 = df.groupby(['Sex', 'Pclass'])['Survived'].sum().unstack(fill_value=0)
table5

Pclass   1   2   3
Sex
female  91  70  72
male    45  17  47

### Handling Missing Data (Age mean by Sex, Survived, Pclass × Embarked)

In [ ]:
table6 = pd.pivot_table(
    df,
    index=['Sex', 'Survived', 'Pclass'],
    columns='Embarked',
    values='Age',
    aggfunc=np.mean,
    fill_value=np.round(df['Age'].mean(), 1)
)
table6

In [ ]:
table7 = (
    df.groupby(['Sex', 'Survived', 'Pclass', 'Embarked'])['Age']
      .mean()
      .unstack(fill_value=np.round(df['Age'].mean(), 1))
)
table7